// Variables

let age = 22 // যখন কোন ভেরিয়েবলের মান পরিবর্তন হওয়ার সম্ভাবনা থাকে তখন আমরা let ব্যবহার করে থাকি। যেমনঃ বয়স। যা পরিবর্তনশীল।
age = 25

const dateOfBirth = "22/12/2001" // যখন কোন ভেরিয়েবলের মান অপরিবর্তিত অবস্থায় রাখা হয় তখন আমরা const ব্যবহার করে থাকি। যেমনঃ জন্ম তারিখ। যা কখনও পরিবর্তন হবে না।


const favouriteFruit = "Mango"
console.log(favouriteFruit);
let city = "Dhaka"
console.log(city);
let isLearning = true
console.log(isLearning);

// =========================================

// ১. পরিচয় চ্যালেঞ্জ (Identity Task)
// এমন একটি ভ্যারিয়েবল নিন যেখানে আপনার নিজের নাম থাকবে।
// আপনার প্রিয় কোডিং ল্যাঙ্গুয়েজ-এর নাম আরেকটি ভ্যারিয়েবলে রাখুন।
// চিন্তা করুন: নাম কি কখনো পরিবর্তন হবে? যদি না হয়, তবে কোনটি const আর কোনটি let হওয়া উচিত?

const myName = "Ashfak Mahmud"
let favouriteLanguage = "JavaScript"


// ২. কেনাকাটার হিসাব (Calculation Task)
// বাজেট: ধরুন আপনার কাছে ১০০০ টাকা আছে। এটি একটি ভ্যারিয়েবলে রাখুন।
// খরচ: আপনি ২০০ টাকার একটি মাউস এবং ১০০ টাকার একটি কিবোর্ড কিনলেন। এই দুইটির দাম আলাদা দুটি ভ্যারিয়েবলে রাখুন।
// বাকি টাকা: বাজেট থেকে খরচ বিয়োগ করে কত টাকা অবশিষ্ট থাকল, তা একটি নতুন ভ্যারিয়েবলে (যেমন: remainedBalance) সেভ করুন।

let total = 1000
let mouse = 200
let keyBoard = 100
let remainedBalance = total - (mouse + keyBoard)
console.log(remainedBalance);


// ৩. লজিক চ্যালেঞ্জ (Status Task)
// আপনি কি এখন জাভাস্ক্রিপ্ট শিখছেন? এই তথ্যটি প্রকাশ করার জন্য একটি ভ্যারিয়েবল ডিক্লেয়ার করুন। এর মান এমন হবে যা কেবল হ্যাঁ (true) অথবা না (false) বোঝায়। (ইঙ্গিত: Boolean টাইপ)।

let isLearningJS = true


// চ্যালেঞ্জ ৪: "ভুল শুধরানো" (The Const Bug)
// একজন প্রোগ্রামার নিচের তথ্যগুলো স্টোর করতে চায়:
// তার বর্তমান ব্যালেন্স: ১০০ টাকা
// তার স্থায়ী আইডি নম্বর: ৫০০০২
// সে ভুলে দুটোই const দিয়ে লিখে ফেলেছে। এখন তাকে আরও ২০ টাকা যোগ করতে হবে। আপনি এমনভাবে ভ্যারিয়েবলগুলো লিখুন যেন ব্যালেন্স আপডেট করা যায় কিন্তু আইডি নম্বর কেউ পরিবর্তন করতে না পারে।
// লক্ষ্য: সঠিক জায়গায় let এবং const ব্যবহার করা।

let bortoman_balance = 100
let add_new_balance = 20
let total_balance = bortoman_balance + add_new_balance
console.log(total_balance);
const idNum = 50002
